# RegisterDockablePane Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..RegisterDockablePane Method
UIApplication Class See Also
---
Adds a new dockable pane to the Revit user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RegisterDockablePane(
	DockablePaneId id,
	string title,
	IDockablePaneProvider provider
)
```

Visual Basic
---
```text
Public Sub RegisterDockablePane ( _
	id As DockablePaneId, _
	title As String, _
	provider As IDockablePaneProvider _
)
```

Visual C++
---
```text
public:
void RegisterDockablePane(
	DockablePaneId^ id,
	String^ title,
	IDockablePaneProvider^ provider
)
```

# ### Parameters
id
    Type: Autodesk.Revit.UI..::..DockablePaneIdUnique identifier for the new pane.
title
    Type: System..::..StringString to use for the pane caption.
provider
    Type: Autodesk.Revit.UI..::..IDockablePaneProviderYour add-in's implementation of the IDockablePaneProvider interface.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if a dockable pane with identifier %id% has already been registered. |

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace